Q1: Consider the Credit card dataset provided. The file Credit Card Data.xlsx has 3 tabs with
the following data:
- Credit Card customer master data
- Spend (Transaction) data
- Card repayment information

Task 1) Check the data for any corrupt data, missing values, incorrect data types etc.

### Approach to task 1

To import the data to three different data frames

In [1]:
# import pandas lib as pd
import pandas as pd

pd.set_option("display.precision", 3)
pd.set_option('display.min_rows', 8)
pd.set_option('display.width', 2000)
 
#Creating three different data frames
cc_cust_data = pd.read_excel('Credit Card Data.xlsx', sheet_name = 'Customer Details')
cc_spend_data = pd.read_excel('Credit Card Data.xlsx', sheet_name = 'Spend')
cc_repayment_data = pd.read_excel('Credit Card Data.xlsx', sheet_name = 'Repayment')



#print(cc_cust_data.head(2))

In [3]:
#Checking the Customer Master data frame

print(cc_cust_data.head(2))

   No Customer  Age       City Product    Limit Company        Segment
0   1       A1   47  BANGALORE    Gold  1500000      C1  Self Employed
1   2       A2   56   CALCUTTA  Silver   300000      C2   Salaried_MNC

In [4]:
#Checking the Spend data frame

print(cc_spend_data.head(2))

   Sl No: Customer      Month       Type         Amount  Unnamed: 5
0       1       A1 2004-01-12  JEWELLERY  344054.980813         NaN
1       2       A1 2004-01-03      PETRO     935.495203         NaN

In [5]:
#Checking the repayment data frame

print(cc_repayment_data.head(2))

   SL No: Customer      Month         Amount
0       1       A1 2006-05-15  230847.254053
1       2       A1 2005-08-27    1835.123777

#### Task 1.1 - Cleaning of the Customer Master Data

In [6]:
#checking the Data types of all columns
cc_cust_data.dtypes

No           int64
Customer    object
Age          int64
City        object
Product     object
Limit        int64
Company     object
Segment     object
dtype: object

In [7]:
print(cc_cust_data.head(4))

   No Customer  Age       City   Product    Limit Company        Segment
0   1       A1   47  BANGALORE      Gold  1500000      C1  Self Employed
1   2       A2   56   CALCUTTA    Silver   300000      C2   Salaried_MNC
2   3       A3   30     COCHIN  Platimum   540000      C3   Salaried_Pvt
3   4       A4   22     BOMBAY  Platimum   840084      C4           Govt

In [9]:
cc_cust_data.info()

#The below table shows that there are no null values, and the data types are also as per the feature information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        100 non-null    int64
 1   Customer  100 non-null    object
 2   Age       100 non-null    int64
 3   City      100 non-null    object
 4   Product   100 non-null    object
 5   Limit     100 non-null    int64
 6   Company   100 non-null    object
 7   Segment   100 non-null    object
dtypes: int64(3), object(5)
memory usage: 6.4+ KB

In [2]:
cc_cust_data.describe()
#The output of describe shows that for numerical columns, there are no outlier values.

            No      Age      Limit
count  100.000  100.000  1.000e+02
mean    50.500   46.460  7.104e+05
std     29.011   17.817  5.298e+05
min      1.000   14.000  1.000e+04
25%     25.750   30.000  4.425e+05
50%     50.500   47.500  5.000e+05
75%     75.250   62.250  1.200e+06
max    100.000   75.000  3.000e+06

In [4]:
cc_cust_data.isnull().sum()
#Thus there are no null values

No          0
Customer    0
Age         0
City        0
Product     0
Limit       0
Company     0
Segment     0
dtype: int64

#### Task 1.2 - Cleaning of the Spends Data

In [5]:
#checking the Data types of all columns
cc_spend_data.dtypes

Sl No:                 int64
Customer              object
Month         datetime64[ns]
Type                  object
Amount               float64
Unnamed: 5           float64
dtype: object

In [6]:
print(cc_spend_data.head(4))

   Sl No: Customer      Month       Type      Amount  Unnamed: 5
0       1       A1 2004-01-12  JEWELLERY  344054.981         NaN
1       2       A1 2004-01-03      PETRO     935.495         NaN
2       3       A1 2004-01-15    CLOTHES    8687.895         NaN
3       4       A1 2004-01-25       FOOD     341.160         NaN

In [7]:
cc_spend_data.info()

#The below table shows that there are null values in only one column 'Unnamed - 5', 
# and the data types are also as per the feature information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sl No:      1500 non-null   int64
 1   Customer    1500 non-null   object
 2   Month       1500 non-null   datetime64[ns]
 3   Type        1500 non-null   object
 4   Amount      1500 non-null   float64
 5   Unnamed: 5  0 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 70.4+ KB

In [8]:
cc_spend_data.describe()
#The output of describe shows that for numerical columns, there are no outlier values (except for Unnamed:5, which should be dropped)

         Sl No:     Amount  Unnamed: 5
count  1500.000  1.500e+03         0.0
mean    750.500  6.224e+04         NaN
std     433.157  1.270e+05         NaN
min       1.000  3.403e+00         NaN
25%     375.750  7.715e+02         NaN
50%     750.500  6.397e+03         NaN
75%    1125.250  3.563e+04         NaN
max    1500.000  1.308e+06         NaN

In [9]:
cc_spend_data.isnull().sum()
#Thus there are null values only in one column, which should be dropped

Sl No:           0
Customer         0
Month            0
Type             0
Amount           0
Unnamed: 5    1500
dtype: int64

In [10]:
#Dropping 'Unnamed: 5'

cc_spend_data.drop('Unnamed: 5', axis=1, inplace=True)
cc_spend_data.head(4)

   Sl No: Customer      Month       Type      Amount
0       1       A1 2004-01-12  JEWELLERY  344054.981
1       2       A1 2004-01-03      PETRO     935.495
2       3       A1 2004-01-15    CLOTHES    8687.895
3       4       A1 2004-01-25       FOOD     341.160

#### Task 1.3 - Cleaning of the Repayments Data

In [11]:
#checking the Data types of all columns
cc_repayment_data.dtypes

SL No:               int64
Customer            object
Month       datetime64[ns]
Amount             float64
dtype: object

In [12]:
print(cc_repayment_data.head(4))

   SL No: Customer      Month     Amount
0       1       A1 2006-05-15  2.308e+05
1       2       A1 2005-08-27  1.835e+03
2       3       A1 2004-03-07  4.859e+03
3       4       A1 2005-03-01  1.361e+06

In [13]:
cc_repayment_data.info()

#The below table shows that there are null values in only one column 'Unnamed - 5', 
# and the data types are also as per the feature information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 807 entries, 0 to 806
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SL No:    807 non-null    int64
 1   Customer  807 non-null    object
 2   Month     803 non-null    datetime64[ns]
 3   Amount    807 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 25.3+ KB

In [17]:
cc_repayment_data.describe()
#The output of describe shows that for numerical columns, there are no outlier values

        SL No:     Amount
count  807.000  8.070e+02
mean   404.000  9.659e+04
std    233.105  1.696e+05
min      1.000  3.121e+00
25%    202.500  1.387e+03
50%    404.000  1.470e+04
75%    605.500  1.013e+05
max    807.000  1.361e+06

In [15]:
cc_repayment_data.isnull().sum()
#Thus there are null values only in one column, Month.

SL No:      0
Customer    0
Month       4
Amount      0
dtype: int64

In [21]:
#Checking the rows where month is null

cc_repayment_data[cc_repayment_data['Month'].isnull()]

     SL No: Customer Month      Amount
274     275      A29   NaT  139343.954
299     300      A30   NaT   75520.695
418     419      A40   NaT    4203.396
789     790       A9   NaT   20150.637

In [24]:
#Replacing NaT values via the ffill method
cc_repayment_data['Month'].ffill(inplace = True)

In [25]:
cc_repayment_data[cc_repayment_data['Month'].isnull()]
#Thus, there are no null values in the Month column

Empty DataFrame
Columns: [SL No:, Customer, Month, Amount]
Index: []

In [26]:
cc_repayment_data.isnull().sum()
#Rechecking for null values again, none found

SL No:      0
Customer    0
Month       0
Amount      0
dtype: int64

### Thus Task 1 has been completed and all the data has been cleaned

### Task 2 : Make the following substitution:
a. Age of credit card customer can't be less than 18. In case age is less than 18, replace
it with mean of age

In [45]:
#The data was checked and 4 rows came up, but unable to revert to the same state. 
#Hence mentioning the code below


age_less_than_18_bool = cc_cust_data['Age'] < 18



cc_cust_data[age_less_than_18_bool]

Empty DataFrame
Columns: [No, Customer, Age, City, Product, Limit, Company, Segment]
Index: []

In [46]:
#Post applying the below replacement, the teenage customers age was replaced by the mean

cc_cust_data[age_less_than_18_bool] = cc_cust_data['Age'].mean()

cc_cust_data[age_less_than_18_bool]

Empty DataFrame
Columns: [No, Customer, Age, City, Product, Limit, Company, Segment]
Index: []

### Task 2 : Age substitution completed

### Task 3 :  3) Answer the following Questions:
1. a. How many unique customers are there?
2. b. How many spend categories are there?
3. c. Which category has the highest average spend?
4. d. What is the average monthly spent by product categories?
5. e. Which customers are reaching 90% or more of their spending limit?
6. f. Which city has the maximum number of spenders, each month? Is there a need to run
campaigns in specific cities?
7. g. Which age group spends the most?

#### Task 3a - How many unique customers are there?

In [47]:
#Reviewing the Customer Data Frame
cc_cust_data.head()

    No Customer   Age       City   Product      Limit Company        Segment
0  1.0       A1  47.0  BANGALORE      Gold  1.500e+06      C1  Self Employed
1  2.0       A2  56.0   CALCUTTA    Silver  3.000e+05      C2   Salaried_MNC
2  3.0       A3  30.0     COCHIN  Platimum  5.400e+05      C3   Salaried_Pvt
3  4.0       A4  22.0     BOMBAY  Platimum  8.401e+05      C4           Govt
4  5.0       A5  59.0  BANGALORE  Platimum  4.201e+05      C5  Normal Salary

In [48]:
#Getting the unique values in the 'Customer' column using the 'unique' attribute

cc_cust_data.Customer.unique

<bound method Series.unique of 0       A1
1       A2
2       A3
3       A4
      ...
96     A97
97     A98
98     A99
99    A100
Name: Customer, Length: 100, dtype: object>

In [49]:
#Getting the count of unique values. The dropna argument was not used as the Nan values were already cleaned. 

cc_cust_data.Customer.nunique()

100

#### Task 3a Output- How many unique customers are there? 
100 Unique Customers

#### Task 3b - How many spend categories are there?

In [57]:
#Checking the spends data frame

cc_spend_data.head()

   Sl No: Customer      Month       Type      Amount
0       1       A1 2004-01-12  JEWELLERY  344054.981
1       2       A1 2004-01-03      PETRO     935.495
2       3       A1 2004-01-15    CLOTHES    8687.895
3       4       A1 2004-01-25       FOOD     341.160
4       5       A1 2005-01-17     CAMERA    3406.639

In [51]:
#Checking the value counts for reference, though 'Unique' remains the preferred way to get the answer

cc_spend_data['Type'].value_counts()

PETRO           200
FOOD            160
CAMERA          160
AIR TICKET      147
TRAIN TICKET    132
SHOPPING        113
BUS TICKET       99
CLOTHES          95
JEWELLERY        95
MOVIE TICKET     76
RENTAL           76
BIKE             49
AUTO             40
CAR              30
SANDALS          28
Name: Type, dtype: int64

In [55]:
#Getting the count of unique Types - checking null values
spend_type_null_check_bool = cc_spend_data.Type.isnull()

cc_spend_data[spend_type_null_check_bool]

Empty DataFrame
Columns: [Sl No:, Customer, Month, Type, Amount]
Index: []

In [56]:
#Getting the count of unique Types

cc_spend_data.Type.nunique()

15

#### Task 3b - output - How many spend categories are there? 
15 Spend categories

#### Task 3c. Which category has the highest average spend?

In [69]:
#Approach, to create a dictionary, containing the means for all spend types and get the max from that

#Step 1 : Create a list of Unique spend types
#Step 2 : Create a for loop to loop through the list and create a dictionary which keys as the spend type and values as the means
#Step 3 : Using the max method for a dictionary, retrieve the key with the max value


#Step 1 : To get the spend types, we can use the value counts method. The series index can be converted to a list
cc_spend_type_list = list(cc_spend_data['Type'].value_counts().index)
cc_spend_type_list

['PETRO',
 'FOOD',
 'CAMERA',
 'AIR TICKET',
 'TRAIN TICKET',
 'SHOPPING',
 'BUS TICKET',
 'CLOTHES',
 'JEWELLERY',
 'MOVIE TICKET',
 'RENTAL',
 'BIKE',
 'AUTO',
 'CAR',
 'SANDALS']

In [74]:
#Step 2 - Creating a dictionary and populating it using the for loop

cc_spend_type_mean_dict = {}

for spend_type in cc_spend_type_list:
    spend_type = spend_type
    spend_type_bool = cc_spend_data['Type'] == spend_type
    spend_type_mean = round(cc_spend_data.loc[spend_type_bool,'Amount'].mean(),2) #Rounding off to two decimal places
    
    if spend_type not in cc_spend_type_mean_dict:
        cc_spend_type_mean_dict[spend_type] = spend_type_mean

print(cc_spend_type_mean_dict)

{'PETRO': 549.48, 'FOOD': 341.17, 'CAMERA': 21499.8, 'AIR TICKET': 254632.19, 'TRAIN TICKET': 1627.49, 'SHOPPING': 7394.33, 'BUS TICKET': 12681.03, 'CLOTHES': 25140.16, 'JEWELLERY': 239218.69, 'MOVIE TICKET': 1875.3, 'RENTAL': 13106.51, 'BIKE': 210701.27, 'AUTO': 27320.76, 'CAR': 409143.47, 'SANDALS': 2516.63}

In [76]:
#Step 3 - Getting the max value from a dictionary
#Ref - https://datagy.io/python-get-dictionary-key-with-max-value/


#As per the max function's definition, we are passing a dictionary which is a set of label,value pairs;
#The 'key' parameter determines the basis on which we want to compare.
#For any dictionary, the output will always be the label. 

#Anther Example

'''
var1 = "geeks"
var2 = "for"
var3 = "geek"
 
max_val = max(var1, var2, var3,
              key=len)
print(max_val)
The output is 'geeks'
'''

max(cc_spend_type_mean_dict,key=cc_spend_type_mean_dict.get)

'CAR'

#### Task 3c. Which category has the highest average spend?
The category is 'CAR'

#### Task 3d. What is the average monthly spent by product categories?

In [80]:
#The same dictionary can be used (Writing each line separately)

for spend in cc_spend_type_mean_dict:
    spend_type1 = spend
    spend_type_mean1 = cc_spend_type_mean_dict[spend]
    print('The average spend is {a}, for the spend category {b}'.format(a = spend_type_mean1, b = spend_type1))

The average spend is 549.48, for the spend category PETRO
The average spend is 341.17, for the spend category FOOD
The average spend is 21499.8, for the spend category CAMERA
The average spend is 254632.19, for the spend category AIR TICKET
The average spend is 1627.49, for the spend category TRAIN TICKET
The average spend is 7394.33, for the spend category SHOPPING
The average spend is 12681.03, for the spend category BUS TICKET
The average spend is 25140.16, for the spend category CLOTHES
The average spend is 239218.69, for the spend category JEWELLERY
The average spend is 1875.3, for the spend category MOVIE TICKET
The average spend is 13106.51, for the spend category RENTAL
The average spend is 210701.27, for the spend category BIKE
The average spend is 27320.76, for the spend category AUTO
The average spend is 409143.47, for the spend category CAR
The average spend is 2516.63, for the spend category SANDALS

In [81]:
#The same dictionary can be used (Converting it into a dataframe)
#Ref - https://datatofish.com/dictionary-to-dataframe/

cc_spend_type_mean_df= pd.DataFrame(list(cc_spend_type_mean_dict.items()),columns = ['Spend Category','Average Expenditure'])

cc_spend_type_mean_df

   Spend Category  Average Expenditure
0           PETRO               549.48
1            FOOD               341.17
2          CAMERA             21499.80
3      AIR TICKET            254632.19
4    TRAIN TICKET              1627.49
5        SHOPPING              7394.33
6      BUS TICKET             12681.03
7         CLOTHES             25140.16
8       JEWELLERY            239218.69
9    MOVIE TICKET              1875.30
10         RENTAL             13106.51
11           BIKE            210701.27
12           AUTO             27320.76
13            CAR            409143.47
14        SANDALS              2516.63

#### Task 3e. Which customers are reaching 90% or more of their spending limit?

In [82]:
#Checking the customer data

cc_cust_data.head(4)

    No Customer   Age       City   Product      Limit Company        Segment
0  1.0       A1  47.0  BANGALORE      Gold  1.500e+06      C1  Self Employed
1  2.0       A2  56.0   CALCUTTA    Silver  3.000e+05      C2   Salaried_MNC
2  3.0       A3  30.0     COCHIN  Platimum  5.400e+05      C3   Salaried_Pvt
3  4.0       A4  22.0     BOMBAY  Platimum  8.401e+05      C4           Govt

In [126]:
#Checking the spend data

cc_spend_data.head()

   Sl No: Customer      Month       Type      Amount
0       1       A1 2004-01-12  JEWELLERY  344054.981
1       2       A1 2004-01-03      PETRO     935.495
2       3       A1 2004-01-15    CLOTHES    8687.895
3       4       A1 2004-01-25       FOOD     341.160
4       5       A1 2005-01-17     CAMERA    3406.639

In [97]:
#This would require data from both the data frames

#Step 1 : Create a list of Unique customers
#Step 2 : Create a dataframe with three columns, customer name, total spend, spend limit
#Step 3 : Compare the customers and retrieve those where the spend exceeds 90% of the limit


#Step 1 : To get the customers
cc_customer_series = cc_cust_data['Customer']

In [96]:
#Creating a blank Dataframe

cc_cust_limit_df = pd.DataFrame()
type(cc_cust_limit_df)

pandas.core.frame.DataFrame

In [98]:
cc_cust_limit_df['Customer'] = cc_customer_series

In [100]:
cc_cust_limit_df['Limit'] = cc_cust_data['Limit']

cc_cust_limit_df

   Customer      Limit
0        A1  1.500e+06
1        A2  3.000e+05
2        A3  5.400e+05
3        A4  8.401e+05
..      ...        ...
96      A97  3.000e+04
97      A98  3.000e+04
98      A99  1.200e+05
99     A100  1.000e+05

[100 rows x 2 columns]

## Checkpoint - 25 July, 6 pm.. Next step, set the index of the new DF to customer and use DF indexing and a for loop to update spend data and the spend limit excess, two more columns would be needed

In [226]:
cc_spend_data.head()

   Sl No: Customer      Month       Type      Amount  month  year
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004
1       2       A1 2004-01-03      PETRO     935.495      1  2004
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004
3       4       A1 2004-01-25       FOOD     341.160      1  2004
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005

In [122]:
# Creating a blank series
series_cust_spend_agg = pd.Series(dtype = 'float64') 
series_cust_spend_agg.dtypes

dtype('float64')

In [247]:
#Aggregating the customer spends data by year
#Creating separate columns for month, year and date

cc_spend_data.head()

cc_spend_data['month']= cc_spend_data['Month'].dt.month
cc_spend_data['year'] = cc_spend_data['Month'].dt.year
cc_spend_data['year_month'] = cc_spend_data['Month'].dt.strftime('%Y-%m')


cc_spend_data.head()

   Sl No: Customer      Month       Type      Amount  month  year  ym-date year_month
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004  2004-01    2004-01
1       2       A1 2004-01-03      PETRO     935.495      1  2004  2004-01    2004-01
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004  2004-01    2004-01
3       4       A1 2004-01-25       FOOD     341.160      1  2004  2004-01    2004-01
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005  2005-01    2005-01

In [200]:
#Aggregating the customer spends data by customer
new_series = pd.Series()
cust_list = list(cc_cust_data['Customer'].value_counts().index)
for customer_id in cust_list:
    bool_cust_id = cc_spend_data['Customer'] == customer_id
    new_series[customer_id] = round(cc_spend_data.loc[bool_cust_id,'Amount'].sum(),2)

print(new_series)

A8     8.767e+05
A21    2.136e+06
A19    9.422e+05
A24    2.290e+06
         ...
A42    2.422e+06
A34    8.268e+04
A56    2.762e+06
A25    1.868e+06
Length: 100, dtype: float64

<ipython-input-200-fd87ee14f817>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  new_series = pd.Series()

In [202]:
series_cust_spend_agg = new_series
#For some reason, the series datatype is becoming int, to be checked in class

series_cust_spend_agg

A8     8.767e+05
A21    2.136e+06
A19    9.422e+05
A24    2.290e+06
         ...
A42    2.422e+06
A34    8.268e+04
A56    2.762e+06
A25    1.868e+06
Length: 100, dtype: float64

In [127]:
#Converting the series to float
series_cust_spend_agg = series_cust_spend_agg.astype('float64')

In [203]:
series_cust_spend_agg

A8     8.767e+05
A21    2.136e+06
A19    9.422e+05
A24    2.290e+06
         ...
A42    2.422e+06
A34    8.268e+04
A56    2.762e+06
A25    1.868e+06
Length: 100, dtype: float64

In [204]:
series_cust_spend_agg.index

Index(['A8', 'A21', 'A19', 'A24', 'A94', 'A49', 'A45', 'A17', 'A98', 'A12', 'A23', 'A92', 'A26', 'A20', 'A5', 'A78', 'A58', 'A76', 'A63', 'A40', 'A39', 'A11', 'A68', 'A27', 'A13', 'A81', 'A82', 'A96', 'A4', 'A90', 'A69', 'A74', 'A64', 'A32', 'A80', 'A59', 'A10', 'A62', 'A3', 'A95', 'A28', 'A46', 'A60', 'A7', 'A51', 'A37', 'A83', 'A91', 'A2', 'A77', 'A54', 'A97', 'A53', 'A89', 'A85', 'A22', 'A29', 'A43', 'A65', 'A1', 'A71', 'A100', 'A14', 'A38', 'A31', 'A48', 'A18', 'A47', 'A93', 'A52', 'A50', 'A9', 'A86', 'A61', 'A66', 'A33', 'A44', 'A72', 'A87', 'A6', 'A99', 'A73', 'A67', 'A57', 'A16', 'A30', 'A79', 'A70', 'A36', 'A35', 'A55', 'A15', 'A84', 'A41', 'A75', 'A88', 'A42', 'A34', 'A56', 'A25'], dtype='object')

In [205]:
#Now that we have a series of all customer aggregate spend, we can add it to the spend limit dataframe (once we set its index to customer)

cc_cust_limit_df.set_index('Customer', inplace = True)
cc_cust_limit_df

          level_0  index      Limit
Customer
A1              0      0  1.500e+06
A2              1      1  3.000e+05
A3              2      2  5.400e+05
A4              3      3  8.401e+05
...           ...    ...        ...
A97            96     96  3.000e+04
A98            97     97  3.000e+04
A99            98     98  1.200e+05
A100           99     99  1.000e+05

[100 rows x 3 columns]

In [206]:
cc_cust_limit_df.index

Index(['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10', 'A11', 'A12', 'A13', 'A14', 'A15', 'A16', 'A17', 'A18', 'A19', 'A20', 'A21', 'A22', 'A23', 'A24', 'A25', 'A26', 'A27', 'A28', 'A29', 'A30', 'A31', 'A32', 'A33', 'A34', 'A35', 'A36', 'A37', 'A38', 'A39', 'A40', 'A41', 'A42', 'A43', 'A44', 'A45', 'A46', 'A47', 'A48', 'A49', 'A50', 'A51', 'A52', 'A53', 'A54', 'A55', 'A56', 'A57', 'A58', 'A59', 'A60', 'A61', 'A62', 'A63', 'A64', 'A65', 'A66', 'A67', 'A68', 'A69', 'A70', 'A71', 'A72', 'A73', 'A74', 'A75', 'A76', 'A77', 'A78', 'A79', 'A80', 'A81', 'A82', 'A83', 'A84', 'A85', 'A86', 'A87', 'A88', 'A89', 'A90', 'A91', 'A92', 'A93', 'A94', 'A95', 'A96', 'A97', 'A98', 'A99', 'A100'], dtype='object', name='Customer')

In [207]:
test_series = series_cust_spend_agg.rename('Customer')
test_series

A8     8.767e+05
A21    2.136e+06
A19    9.422e+05
A24    2.290e+06
         ...
A42    2.422e+06
A34    8.268e+04
A56    2.762e+06
A25    1.868e+06
Name: Customer, Length: 100, dtype: float64

In [208]:
test_df =  series_cust_spend_agg.to_frame()
test_df.columns = ['Amount']
test_df.reset_index(inplace = True)

test_df.head()

  index     Amount
0    A8  8.767e+05
1   A21  2.136e+06
2   A19  9.422e+05
3   A24  2.290e+06
4   A94  3.819e+02

In [209]:
cc_cust_limit_df.reset_index(inplace = True)
cc_cust_limit_df.head()

  Customer  level_0  index      Limit
0       A1        0      0  1.500e+06
1       A2        1      1  3.000e+05
2       A3        2      2  5.400e+05
3       A4        3      3  8.401e+05
4       A5        4      4  4.201e+05

In [210]:
merged_df = pd.merge(cc_cust_limit_df, test_df,  how='inner', left_on='Customer', right_on = 'index')
merged_df.head()

  Customer  level_0  index_x      Limit index_y     Amount
0       A1        0        0  1.500e+06      A1  2.203e+06
1       A2        1        1  3.000e+05      A2  1.755e+05
2       A3        2        2  5.400e+05      A3  5.334e+05
3       A4        3        3  8.401e+05      A4  9.047e+05
4       A5        4        4  4.201e+05      A5  9.235e+05

In [211]:
merged_df.drop(['level_0', 'index_x', 'index_y'], axis=1,inplace = True)
#Columns were dropped

In [212]:
#A clean combined dataframe
merged_df.head()

  Customer      Limit     Amount
0       A1  1.500e+06  2.203e+06
1       A2  3.000e+05  1.755e+05
2       A3  5.400e+05  5.334e+05
3       A4  8.401e+05  9.047e+05
4       A5  4.201e+05  9.235e+05

In [250]:
#Since this is the total amount, we need to break it down by year-month, to get a more accurate picture of the customer spend

df_spends_by_monthyear = cc_spend_data[['Customer','Amount', 'year_month']]



df_spends_by_monthyear_grouped = df_spends_by_monthyear.groupby(['Customer', 'year_month']).sum() 

df_spends_by_monthyear_grouped

                         Amount
Customer year_month
A1       2004-01     357701.216
         2004-02       4858.701
         2004-05       2033.749
         2005-01       3406.639
...                         ...
A96      2004-01      94369.179
A97      2004-01      13440.467
A98      2004-01      12746.026
A99      2004-01     108137.195

[807 rows x 1 columns]

In [251]:
df_spends_by_monthyear = cc_spend_data[['Customer','Amount', 'year']]



df_spends_by_year_grouped = df_spends_by_monthyear.groupby(['Customer', 'year']).sum() 

df_spends_by_year_grouped

                  Amount
Customer year
A1       2004  3.646e+05
         2005  1.366e+06
         2006  4.717e+05
A10      2004  3.836e+04
...                  ...
A96      2004  9.437e+04
A97      2004  1.344e+04
A98      2004  1.275e+04
A99      2004  1.081e+05

[233 rows x 1 columns]

In [254]:
df_spends_by_year_grouped.reset_index(inplace = True)

df_spends_by_year_grouped

     index Customer  year     Amount
0        0       A1  2004  3.646e+05
1        1       A1  2005  1.366e+06
2        2       A1  2006  4.717e+05
3        3      A10  2004  3.836e+04
..     ...      ...   ...        ...
229    229      A96  2004  9.437e+04
230    230      A97  2004  1.344e+04
231    231      A98  2004  1.275e+04
232    232      A99  2004  1.081e+05

[233 rows x 4 columns]

In [263]:
#Combining the merged df

merged_df.rename(columns = {'Amount': 'Total_Amount'}, inplace = True)
#merged_df.drop('Percentage_of_limit', axis = 1, inplace = True)
merged_df.head()

merged_df2 = pd.merge(merged_df, df_spends_by_year_grouped,  how='outer', left_on='Customer', right_on = 'Customer')
merged_df2.rename(columns = {'Amount': 'Amount_year'}, inplace = True)
merged_df2.head()

  Customer      Limit  Total_Amount  index  year  Amount_year
0       A1  1.500e+06     2.203e+06      0  2004    3.646e+05
1       A1  1.500e+06     2.203e+06      1  2005    1.366e+06
2       A1  1.500e+06     2.203e+06      2  2006    4.717e+05
3       A2  3.000e+05     1.755e+05     34  2004    1.507e+04
4       A2  3.000e+05     1.755e+05     35  2005    1.463e+05

In [264]:
merged_df2['percent_spend_year'] = merged_df2['Amount_year']/merged_df2['Limit']
merged_df2.head()

  Customer      Limit  Total_Amount  index  year  Amount_year  percent_spend_year
0       A1  1.500e+06     2.203e+06      0  2004    3.646e+05               0.243
1       A1  1.500e+06     2.203e+06      1  2005    1.366e+06               0.911
2       A1  1.500e+06     2.203e+06      2  2006    4.717e+05               0.314
3       A2  3.000e+05     1.755e+05     34  2004    1.507e+04               0.050
4       A2  3.000e+05     1.755e+05     35  2005    1.463e+05               0.488

In [270]:
merged_df2.to_excel('merged_df2.xlsx')

In [268]:
#Filtering out customers with greater than 90% spend, along with the year when they crossed the spend limit

bool_90_plus = merged_df2['percent_spend_year'] >= 0.9

merged_df2.loc[bool_90_plus,['Customer','year']]

    Customer  year
1         A1  2005
8         A3  2006
9         A4  2004
13        A5  2005
14        A5  2006
20        A7  2006
32       A11  2006
38       A13  2006
43       A15  2005
45       A16  2004
47       A16  2006
53       A18  2006
59       A20  2006
62       A21  2006
71       A24  2006
73       A25  2005
76       A26  2005
77       A26  2006
79       A27  2005
98       A33  2006
104      A35  2006
105      A36  2004
108      A37  2004
116      A39  2006
137      A46  2006
138      A47  2004
140      A47  2006
142      A48  2005
143      A48  2006
146      A49  2006
150      A51  2004
154      A52  2005
157      A53  2005
167      A56  2006
175      A59  2005
181      A61  2005
182      A61  2006
184      A62  2005
185      A62  2006
198      A69  2005
228      A96  2004
231      A99  2004

#### Task 3e. Which customers are reaching 90% or more of their spending limit?
Answered in the cell above, along with the year

#### Task 3f. Which city has the maximum number of spenders, each month? Is there a need to run campaigns in specific cities?

In [271]:
cc_spend_data.head()

   Sl No: Customer      Month       Type      Amount  month  year  ym-date year_month
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004  2004-01    2004-01
1       2       A1 2004-01-03      PETRO     935.495      1  2004  2004-01    2004-01
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004  2004-01    2004-01
3       4       A1 2004-01-25       FOOD     341.160      1  2004  2004-01    2004-01
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005  2005-01    2005-01

In [272]:
cc_cust_data.head()

    No Customer   Age       City   Product      Limit Company        Segment
0  1.0       A1  47.0  BANGALORE      Gold  1.500e+06      C1  Self Employed
1  2.0       A2  56.0   CALCUTTA    Silver  3.000e+05      C2   Salaried_MNC
2  3.0       A3  30.0     COCHIN  Platimum  5.400e+05      C3   Salaried_Pvt
3  4.0       A4  22.0     BOMBAY  Platimum  8.401e+05      C4           Govt
4  5.0       A5  59.0  BANGALORE  Platimum  4.201e+05      C5  Normal Salary

In [300]:

merged_df3 = pd.merge(cc_spend_data, cc_cust_data[['Customer', 'City']],  how='left', left_on='Customer', right_on = 'Customer')
merged_df3.head()

merged_df3.drop('City_x', axis = 1, inplace = True)
merged_df3.rename(columns = {'City_y' : 'City'}, inplace = True)
merged_df3.head()

   Sl No: Customer      Month       Type      Amount  month  year  ym-date year_month       City
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004  2004-01    2004-01  BANGALORE
1       2       A1 2004-01-03      PETRO     935.495      1  2004  2004-01    2004-01  BANGALORE
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004  2004-01    2004-01  BANGALORE
3       4       A1 2004-01-25       FOOD     341.160      1  2004  2004-01    2004-01  BANGALORE
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005  2005-01    2005-01  BANGALORE

In [301]:
merged_df3.head()

   Sl No: Customer      Month       Type      Amount  month  year  ym-date year_month       City
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004  2004-01    2004-01  BANGALORE
1       2       A1 2004-01-03      PETRO     935.495      1  2004  2004-01    2004-01  BANGALORE
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004  2004-01    2004-01  BANGALORE
3       4       A1 2004-01-25       FOOD     341.160      1  2004  2004-01    2004-01  BANGALORE
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005  2005-01    2005-01  BANGALORE

In [313]:
df_month_city = merged_df3.groupby(['month', 'City']).sum()['Amount']

In [328]:
df_month_city = df_month_city.reset_index()
df_month_city.dtypes

level_0      int64
index        int64
month        int64
City        object
Amount     float64
dtype: object

In [378]:
#Attempting a hardcoded example for march month before implementing the for loop
bool_month = df_month_city['month'] == 3
df5 = df_month_city[bool_month]
bool_max = df5['Amount'] == df5['Amount'].max()
a = df5.loc[bool_max,'City']
print(a.values[0])

BOMBAY

In [394]:
month_list = list(range(1,13))
max_city_list = []
max_city_dict = {}

for month in month_list:
    bool_month = df_month_city['month'] == month
    df5 = df_month_city[bool_month]
    bool_max = df5['Amount'] == df5['Amount'].max()
    a = df5.loc[bool_max,'City'].values[0]
    if a not in max_city_list:
        max_city_list.append(a)
    if a not in max_city_dict:
        max_city_dict[month] = a
    print('The max buyers for month {x} are from the city {y}'.format(x = month, y = a))

The max buyers for month 1 are from the city COCHIN
The max buyers for month 2 are from the city COCHIN
The max buyers for month 3 are from the city BOMBAY
The max buyers for month 4 are from the city COCHIN
The max buyers for month 5 are from the city BANGALORE
The max buyers for month 6 are from the city COCHIN
The max buyers for month 7 are from the city COCHIN
The max buyers for month 8 are from the city BOMBAY
The max buyers for month 9 are from the city CALCUTTA
The max buyers for month 10 are from the city BANGALORE
The max buyers for month 11 are from the city BOMBAY
The max buyers for month 12 are from the city COCHIN

In [385]:
max_city_list

['COCHIN', 'BOMBAY', 'BANGALORE', 'CALCUTTA']

In [396]:
print(max_city_dict)

{1: 'COCHIN', 2: 'COCHIN', 3: 'BOMBAY', 4: 'COCHIN', 5: 'BANGALORE', 6: 'COCHIN', 7: 'COCHIN', 8: 'BOMBAY', 9: 'CALCUTTA', 10: 'BANGALORE', 11: 'BOMBAY', 12: 'COCHIN'}

In [392]:
all_city_list = list(merged_df3['City'].value_counts().index)
all_city_list

['BANGALORE',
 'COCHIN',
 'CALCUTTA',
 'BOMBAY',
 'CHENNAI',
 'TRIVANDRUM',
 'PATNA',
 'DELHI']

In [393]:
#Getting the cities not in max city list
cities_needing_campaigning = []
for city in all_city_list:
    if city not in max_city_list:
        cities_needing_campaigning.append(city)

print(cities_needing_campaigning)

['CHENNAI', 'TRIVANDRUM', 'PATNA', 'DELHI']

#### Ans 3.f :Which city has the maximum number of spenders, each month? Is there a need to run campaigns in specific cities
             max_city_dict = {1: 'COCHIN', 2: 'COCHIN', 3: 'BOMBAY', 4: 'COCHIN', 5: 'BANGALORE', 6: 'COCHIN', 7: 'COCHIN',                                   8: 'BOMBAY', 9: 'CALCUTTA', 10: 'BANGALORE', 11: 'BOMBAY', 12: 'COCHIN'}
             max_city list = ['COCHIN', 'BOMBAY', 'BANGALORE', 'CALCUTTA']
             cities_needing_campaigninng = ['CHENNAI', 'TRIVANDRUM', 'PATNA', 'DELHI']

#### 3.g - Which age group spends the most

In [398]:
merged_df4 = pd.merge(cc_spend_data, cc_cust_data[['Customer', 'City','Age']],  how='left', left_on='Customer', right_on = 'Customer')
merged_df4.head()

merged_df4.drop('City_x', axis = 1, inplace = True)
merged_df4.rename(columns = {'City_y' : 'City'}, inplace = True)
merged_df4.head()

   Sl No: Customer      Month       Type      Amount  month  year  ym-date year_month       City   Age
0       1       A1 2004-01-12  JEWELLERY  344054.981      1  2004  2004-01    2004-01  BANGALORE  47.0
1       2       A1 2004-01-03      PETRO     935.495      1  2004  2004-01    2004-01  BANGALORE  47.0
2       3       A1 2004-01-15    CLOTHES    8687.895      1  2004  2004-01    2004-01  BANGALORE  47.0
3       4       A1 2004-01-25       FOOD     341.160      1  2004  2004-01    2004-01  BANGALORE  47.0
4       5       A1 2005-01-17     CAMERA    3406.639      1  2005  2005-01    2005-01  BANGALORE  47.0

In [399]:
df_age = merged_df4.groupby(['Age']).sum()['Amount']

In [402]:
merged_df4.to_excel('merged_df4.xlsx')

In [404]:
test_bin_df = merged_df4

In [405]:
a = range(test_bin_df['Age'].min(), test_bin_df['Age'].max())

TypeError: 'float' object cannot be interpreted as an integer

In [414]:
#a = range(test_bin_df['Age'].min(), test_bin_df['Age'].max())
test_bin_df['bin'] = pd.cut(test_bin_df['Age'], bins = [0,20,35,50,100,150])

In [413]:
test_bin_df

      Sl No: Customer      Month        Type      Amount  month  year  ym-date year_month        City    Age       bin
0          1       A1 2004-01-12   JEWELLERY  344054.981      1  2004  2004-01    2004-01   BANGALORE  47.00  (10, 50]
1          2       A1 2004-01-03       PETRO     935.495      1  2004  2004-01    2004-01   BANGALORE  47.00  (10, 50]
2          3       A1 2004-01-15     CLOTHES    8687.895      1  2004  2004-01    2004-01   BANGALORE  47.00  (10, 50]
3          4       A1 2004-01-25        FOOD     341.160      1  2004  2004-01    2004-01   BANGALORE  47.00  (10, 50]
...      ...      ...        ...         ...         ...    ...   ...      ...        ...         ...    ...       ...
1496    1497      A68 2006-03-25  BUS TICKET   22218.201      3  2006  2006-03    2006-03  TRIVANDRUM  44.00  (10, 50]
1497    1498      A69 2006-03-31  BUS TICKET   10004.908      3  2006  2006-03    2006-03    CALCUTTA  30.00  (10, 50]
1498    1499      A70 2006-03-23  BUS TICKET   31630.825      3  2006  2006-03    2006-03      BOMBAY  46.46  (10, 50]
1499    1500      A71 2006-03-24  BUS TICKET   33048.374      3  2006  2006-03    2006-03      BOMBAY  46.00  (10, 50]

[1500 rows x 12 columns]

In [415]:
df_age = test_bin_df.groupby(['bin']).sum()['Amount']

In [420]:
df_age.idxmax()

Interval(50, 100, closed='right')

#### 3.g- Thus we can see that the age group 50-100 spends the maximum